app/controllers/users_controller.rb

INSERT INTO `users` (`email`, `nombre`, `apellido`) VALUES ('hgr0221@gmail.com', 'harold', 'giraldo restrepo')
---
  def create
    @user = User.new(params[:user])
    if @user.save

SELECT `users`.* FROM `users` WHERE (`users`.`id` = 4) LIMIT 1
---
  def edit
  @user = User.find(params[:id])

SELECT `users`.* FROM `users` WHERE (`users`.`id` = 6) LIMIT 1
UPDATE `users` SET `apellido` = 'salgado salgado' WHERE (`users`.`id` = 6)
---
  def update
  @user = User.find(params[:id])
  @user.update_attributes(params[:user])

SELECT `users`.* FROM `users` WHERE (`users`.`id` = 4) LIMIT 1
DELETE FROM `users` WHERE (`users`.`id` = 4)
---
  def destroy
  @user = User.find(params[:id])
  flash[:notice] = "el user "+@user.nombre+" eliminado con éxito"
  @user.destroy